let questions = [
    {
        numb: 1,
        question: "PHP тілі алғаш рет қашан жасалды?",
        answer: "1995 жылы",
        options: [
            "1993 жылы",
            "1995 жылы",
            "2000 жылы",
            "1997 жылы"
        ]
    },
    {
        numb: 2,
        question: "PHP тілінің негізгі ерекшелігі қандай?",
        answer: "Веб-дамуға арналған ашық кодты тіл",
        options: [
            "Тек мобильді қосымшалар үшін қолдану",
            "Веб-дамуға арналған ашық кодты тіл",
            "Мәліметтер базасын басқару үшін арналған",
            "Графикалық интерфейстерді құру үшін арналған"
        ]
    },
    {
        numb: 3,
        question: "PHP тілінің негізгі әзірлеушісі кім?",
        answer: "Расмус Лердорф",
        options: [
            "Расмус Лердорф",
            "Джеймс Гослинг",
            "Бьёрн Страуструп",
            "Гвидо ван Россум"
        ]
    },
    {
        numb: 4,
        question: "PHP қандай бағдарламалау тілдеріне жатады?",
        answer: "Серверлік бағдарламалау тілі",
        options: [
            "Серверлік бағдарламалау тілі",
            "Клиенттік бағдарламалау тілі",
            "Мобильді бағдарламалау тілі",
            "Графикалық бағдарламалау тілі"
        ]
    },
    {
        numb: 5,
        question: "PHP-де мәліметтер базасымен жұмыс істеу үшін қандай кеңейтімдер пайдаланылады?",
        answer: "MySQLi және PDO",
        options: [
            "MySQLi және PDO",
            "PostgreSQL және SQLite",
            "MongoDB және Redis",
            "Oracle және SQL Server"
        ]
    }
];
