let questions = [
    {
        numb: 1,
        question: "HTML не үшін қолданылады?",
        answer: "Веб-парақтардың құрылымын құру үшін",
        options: [
            "Веб-парақтардың құрылымын құру үшін",
            "Суреттерді өңдеу үшін",
            "Бағдарламалар жасау үшін",
            "Деректер базасын басқару үшін"
        ]
    },
    {
        numb: 2,
        question: "HTML файлының кеңейтілуі қандай?",
        answer: ".html немесе .htm",
        options: [
            ".html немесе .htm",
            ".txt",
            ".docx",
            ".css"
        ]
    },
    {
        numb: 3,
        question: "HTML құжатының негізгі құрылымдық бөлігі қайсысы?",
        answer: "Элемент",
        options: [
            "Элемент",
            "Файл",
            "Тег",
            "Атрибут"
        ]
    },
    {
        numb: 4,
        question: "HTML құжатын қай бағдарламада ашуға болады?",
        answer: "Кез келген веб-браузерде",
        options: [
            "Кез келген веб-браузерде",
            "Тек мәтіндік редакторда",
            "Графикалық редакторда",
            "Бағдарламалық код редакторында"
        ]
    },
    {
        numb: 5,
        question: "HTML-ді алғаш кім және қашан жасады?",
        answer: "Тим Бернерс-Ли, 1991 жылы",
        options: [
            "Тим Бернерс-Ли, 1991 жылы",
            "Билл Гейтс, 1989 жылы",
            "Марк Цукерберг, 2004 жылы",
            "Стив Джобс, 1985 жылы"
        ]
    }
  ];
  