let questions = [
    {
        numb: 1,
        question: "Python тілі алғаш рет қашан жасалды?",
        answer: "1991 жылы",
        options: [
            "1985 жылы",
            "1991 жылы",
            "2000 жылы",
            "1998 жылы"
        ]
    },
    {
        numb: 2,
        question: "Python тілінің негізгі ерекшелігі қандай?",
        answer: "Оқылу жеңілдігі және көп салалы қолдану",
        options: [
            "Суреттерді өңдеу үшін арнайы болу",
            "Тек веб-даму үшін қолдану",
            "Оқылу жеңілдігі және көп салалы қолдану",
            "Жоғары жылдамдықтағы компиляция"
        ]
    },
    {
        numb: 3,
        question: "Python тілінің негізгі әзірлеушісі кім?",
        answer: "Гвидо ван Россум",
        options: [
            "Гвидо ван Россум",
            "Бьёрн Страуструп",
            "Джеймс Гослинг",
            "Деннис Ритчи"
        ]
    },
    {
        numb: 4,
        question: "Python қандай бағдарламалау тілдеріне жатады?",
        answer: "Интерпретацияланатын тіл",
        options: [
            "Интерпретацияланатын тіл",
            "Компиляцияланатын тіл",
            "Машина тілі",
            "Нақты уақыттық тіл"
        ]
    },
    {
        numb: 5,
        question: "Python-да қандай типтер негізгі мәліметтер типтеріне жатады?",
        answer: "Сандар, жолдар, тізімдер",
        options: [
            "Сандар, жолдар, тізімдер",
            "Сыныптар, әдістер, модульдер",
            "HTML, CSS, JS",
            "Деректер базалары мен кестелер"
        ]
    }
];
